# logging — це стандартна бібліотека Python для запису повідомлень про роботу програми. Вона допомагає
# відстежувати виконання завдань, фіксувати помилки та діагностувати проблеми.
#
# Основні рівні логування:
#
# * DEBUG — детальна технічна інформація.
# * INFO — звичайні інформаційні повідомлення.
# * WARNING — попередження про потенційні проблеми.
# * ERROR — помилки.
# * CRITICAL — критичні помилки.


LOGGING = {
    "version": 1,
    "disable_existing_loggers": False,
    "handlers": {
        "console": {"class": "logging.StreamHandler"},
    },
    # Налаштовуємо кореневий логер:
    "root": {
        "handlers": ["console"], # усе передаватиметься в консоль
        "level": "INFO" # виводимо повідомлення рівня INFO та вище
    },
}
